In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pyplot

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from Functions import *

In [4]:
df1=pd.read_csv("fe_binning.csv")

In [5]:
df1.head()

       country  happiness
0  Afghanistan   3.982855
1      Albania   4.606651
2    Argentina   6.697131
3      Armenia   4.348320
4    Australia   7.309061

In [16]:
#Allocate happiness to bins
binned=pd.cut(df1["happiness"], bins=[0,4,6,10], labels=["L","M","H"])

#Add the binned values aas a categorical feature
df1["happiness_band"]=binned

In [10]:
df1.head()

       country  happiness
0  Afghanistan   3.982855
1      Albania   4.606651
2    Argentina   6.697131
3      Armenia   4.348320
4    Australia   7.309061

In [11]:
#Inspect the no of inviduals in each of the created classes
df1.groupby("happiness_band").size()

KeyError: 'happiness_band'

In [12]:
##Categorical Binning
mapping=pd.read_csv("country_region.csv")

In [13]:

df1 = pd.merge(df1, mapping, left_on='country', right_on='country', how="left")

 df1.head()

In [14]:
df1.head()

       country  happiness                     region
0  Afghanistan   3.982855                 South Asia
1      Albania   4.606651      Europe & Central Asia
2    Argentina   6.697131  Latin America & Caribbean
3      Armenia   4.348320      Europe & Central Asia
4    Australia   7.309061        East Asia & Pacific

In [15]:
##Splitting
df2=pd.read_csv("fe_splitting.csv")

In [16]:
df2.head()

,borough,property_type,timestamp_of_call
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 16:48
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 22:20
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 09:51
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 00:28
4,Barking And dagenham,House - single occupancy,01/01/2017 13:33

In [17]:
df2["timestamp_of_call"]=pd.to_datetime(df2["timestamp_of_call"])

In [18]:
df2.head()

,borough,property_type,timestamp_of_call
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 16:48:00
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 22:20:00
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 09:51:00
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 00:28:00
4,Barking And dagenham,House - single occupancy,2017-01-01 13:33:00

In [19]:
df2.dtypes

borough                      object
property_type                object
timestamp_of_call    datetime64[ns]
dtype: object

In [20]:
df2["day"]=df2["timestamp_of_call"].dt.day

In [21]:
df2["weekday"]=df2["timestamp_of_call"].dt.weekday

In [22]:
df2["month"]=df2["timestamp_of_call"].dt.month

In [23]:
df2["hour"]=df2["timestamp_of_call"].dt.hour

In [24]:
df2["year"]=df2["timestamp_of_call"].dt.year

In [25]:
df2.head()

,borough,property_type,timestamp_of_call,day,weekday,month,hour,year
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 16:48:00,1,6,1,16,2017
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 22:20:00,1,6,1,22,2017
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 09:51:00,1,6,1,9,2017
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 00:28:00,1,6,1,0,2017
4,Barking And dagenham,House - single occupancy,2017-01-01 13:33:00,1,6,1,13,2017

In [26]:
###Compund String splitting
df3=pd.read_csv("fe_splitting.csv")

In [27]:
df3.head()

,borough,property_type,timestamp_of_call
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 16:48
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 22:20
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 09:51
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 00:28
4,Barking And dagenham,House - single occupancy,01/01/2017 13:33

In [28]:
df3["property_type"].unique()

array(['Purpose Built Flats/Maisonettes - 4 to 9 storeys',
       'House - single occupancy',
       'Converted Flat/Maisonette - Up to 2 storeys',
       'Purpose Built Flats/Maisonettes - Up to 3 storeys',
       'Purpose Built Flats/Maisonettes - 10 or more storeys',
       'Converted Flat/Maisonettes - 3 or more storeys',
       'Self contained Sheltered Housing',
       'Unlicensed House in Multiple Occupation - Up to 2 storeys',
       'House in Multiple Occupation - 3 or more storeys (not known if licensed)',
       'Student Hall of Residence', 'Other Residential Home',
       'Unlicensed House in Multiple Occupation - 3 or more storeys',
       'Nursing/Care Home/Hospice', "Nurses'/Doctors' accommodation",
       'House in Multiple Occupation - Up to 2 storeys (not known if licensed)',
       'Hotel/motel', "Children's Home",
       'Hostel (e.g. for homeless people)', 'Retirement/Old Persons Home',
       'Licensed House in Multiple Occupation - Up to 2 storeys',
       'Bungalow - single occupancy', 'Other Dwelling',
       'Military/barracks', 'Houseboat (permanent dwelling)',
       'Licensed House in Multiple Occupation - 3 or more storeys',
       'Boarding House/B&B for homeless/asylum seekers',
       'Caravan/Mobile home (permanent dwelling)'], dtype=object)

In [31]:
df3[['property_type_type','property_type_size']]=df3['property_type'].str.split('-',expand=True)

In [32]:
df3.head()

,borough,property_type,timestamp_of_call,property_type_type,property_type_size
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 16:48,Purpose Built Flats/Maisonettes,4 to 9 storeys
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 22:20,Purpose Built Flats/Maisonettes,4 to 9 storeys
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 09:51,Purpose Built Flats/Maisonettes,4 to 9 storeys
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 00:28,Purpose Built Flats/Maisonettes,4 to 9 storeys
4,Barking And dagenham,House - single occupancy,01/01/2017 13:33,House,single occupancy

In [49]:
###One-Hot-Encoding
df4=pd.read_csv("fe_one_hot.csv")

In [50]:
df4.head()

       country  happiness                     region
0  Afghanistan   3.982855                 South Asia
1      Albania   4.606651      Europe & Central Asia
2    Argentina   6.697131  Latin America & Caribbean
3      Armenia   4.348320      Europe & Central Asia
4    Australia   7.309061        East Asia & Pacific

In [51]:
region_one_hot=pd.get_dummies(df4.region)

In [52]:
region_one_hot.head()

,East Asia & Pacific,Europe & Central Asia,Latin America & Caribbean,Middle East & North Africa,North America,South Asia,Sub-Saharan Africa
0,0,0,0,0,0,1,0
1,0,1,0,0,0,0,0
2,0,0,1,0,0,0,0
3,0,1,0,0,0,0,0
4,1,0,0,0,0,0,0

In [53]:
df4=df4.join(region_one_hot).drop('region', axis=1)
df4.head()

,country,happiness,East Asia & Pacific,Europe & Central Asia,Latin America & Caribbean,Middle East & North Africa,North America,South Asia,Sub-Saharan Africa
0,Afghanistan,3.982855,0,0,0,0,0,1,0
1,Albania,4.606651,0,1,0,0,0,0,0
2,Argentina,6.697131,0,0,1,0,0,0,0
3,Armenia,4.348320,0,1,0,0,0,0,0
4,Australia,7.309061,1,0,0,0,0,0,0

In [ ]:
##Calculated Features
df5=pd.read